app/controllers/movies_controller.rb

SELECT rating FROM "movies"
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG') ORDER BY release_date
---
  def index
	@all_ratings = Movie.select(:rating).map(&:rating).uniq

	session[:ratings]=params[:ratings] if params[:ratings]
	session[:order]=params[:ord] if params[:ord]

	if session[:ratings]
		@selected_ratings=session[:ratings].keys
	else
		@selected_ratings= @all_ratings
	end

	if session[:order]
		@movies= Movie.where(:rating => @selected_ratings).order(session[:order])